{
  "welcome": "Bienvenido",
  "close": "Cerrar",
  "home": "Inicio",
  "shop": "Tienda",
  "aboutMe": "Sobre Mí",
  "stores": "Tiendas",
  "profile": "Perfil",
  "business": "Negocios",
  "educationalOffer": "Oferta educativa",
  "playCourseAudio": "Escuchar audio",
  "pauseCourseAudio": "Stop",
  "application": "Inscribir",
  "seeVideoButton": "Ver Video",
  "videos": "Videos",
  "cookieConsent": "Este sitio utiliza cookies para mejorar la experiencia del usuario. Al hacer clic en aceptar, usted consiente el uso de todas las cookies.",
  "accept": "Aceptar",
  "portfolio": "Portafolio",
  "projects": "Proyectos",
  "contactMe": "Contacta conmigo",
  "JavaScript": "Permite crear aplicaciones web dinámicas e interactivas, crucial para desarrollar interfaces fáciles de usar.",
  "TypeScript": "Mejora la confiabilidad y escalabilidad del código, esencial para trabajar en proyectos complejos.",
  "Node.js": "Soporta operaciones de backend al permitir soluciones escalables y eficientes del lado del servidor.",
  "Vue.js": "Facilita la creación de interfaces de usuario modernas, haciendo que los proyectos sean más modulares e interactivos.",
  "Nuxt.js": "Simplifica la creación de aplicaciones renderizadas en el servidor, mejorando el rendimiento y el SEO en tareas diarias.",
  "Pinia": "Simplifica la gestión de estado, ayudando a mantener aplicaciones mejor estructuradas.",
  "Elixir": "Mejora la escalabilidad y tolerancia a fallos, vital para sistemas robustos de backend.",
  "Django": "Acelera el desarrollo de aplicaciones web con estructuras de código limpias y mantenibles.",
  "HTML": "Proporciona la base para todo el contenido web con el que trabajo, formando la estructura esencial.",
  "CSS": "Mejora la estética del proyecto al permitir un control preciso sobre el diseño y la presentación.",
  "Tailwind CSS": "Acelera los procesos de diseño con clases predefinidas, asegurando consistencia.",
  "Git": "Permite el control de versiones y una colaboración fluida, crucial para gestionar iteraciones de proyectos.",
  "GitHub": "Proporciona una plataforma para gestionar repositorios de código y colaborar con equipos de manera efectiva.",
  "MySQL": "Gestiona el almacenamiento y recuperación de datos estructurados, esencial para aplicaciones basadas en bases de datos.",
  "PostgreSQL": "Maneja consultas complejas y grandes volúmenes de datos, mejorando el rendimiento de bases de datos en proyectos.",
  "Internet of Things (IoT)": "Permite la integración de dispositivos físicos en sistemas, mejorando las capacidades de automatización en proyectos.",
  "Machine Learning": "Proporciona herramientas para analizar datos y construir modelos predictivos para automatización y toma de decisiones.",
  "Artificial Intelligence (AI)": "Permite implementar soluciones inteligentes como chatbots y sistemas de recomendación.",
  "Big Data": "Maneja grandes volúmenes de datos de manera eficiente, proporcionando información crucial para la planificación estratégica.",
  "Cybersecurity": "Garantiza la seguridad y confiabilidad de aplicaciones y redes durante el desarrollo.",
  "Cloud Computing": "Facilita el despliegue de aplicaciones escalables y la gestión de infraestructura.",
  "Data Analytics": "Ayuda a derivar información accionable de los datos para mejorar procesos y resultados.",
  "Ethical Hacking": "Mejora la seguridad de las aplicaciones al identificar vulnerabilidades y mitigar riesgos.",
  "NetBIOS": "Asiste en la enumeración de redes para identificar recursos y vulnerabilidades.",
  "SNMP": "Proporciona monitoreo y gestión de dispositivos de red para mantener el rendimiento.",
  "SMTP and DNS Enumeration": "Ayuda a asegurar servicios de correo y sistemas de dominio al identificar debilidades.",
  "IPsec Configuration Scanning": "Garantiza comunicaciones seguras al analizar configuraciones de VPN.",
  "SIP Protocol": "Permite el análisis de sistemas VoIP, mejorando soluciones de comunicación.",
  "VoIP Analysis": "Mejora la confiabilidad y seguridad de redes de comunicación por voz.",
  "System Hacking": "Identifica y soluciona vulnerabilidades en sistemas para mejorar la seguridad.",
  "Malware Threats": "Analiza y mitiga riesgos de malware para proteger sistemas y datos.",
  "Sniffing Techniques": "Monitorea el tráfico de red para identificar posibles amenazas o ineficiencias.",
  "Denial of Service Attacks": "Proporciona información para prevenir interrupciones en los servicios de aplicaciones.",
  "Hijacking": "Ayuda a proteger sistemas contra accesos no autorizados durante el desarrollo.",
  "Evading IDS, Firewalls, and Honeypots": "Garantiza que los sistemas sean seguros contra intentos de penetración durante las pruebas.",
  "Web Server Hacking": "Mejora la seguridad de servidores al identificar y solucionar vulnerabilidades.",
  "Web Application Hacking": "Refuerza la seguridad de aplicaciones al abordar proactivamente posibles exploits.",
  "Cross-Site Scripting (XSS)": "Protege aplicaciones web contra inyecciones de código malicioso.",
  "SQL Injection": "Fortalece la seguridad de bases de datos al prevenir accesos no autorizados a los datos.",
  "File and Resource Attacks": "Garantiza el manejo seguro de archivos y recursos en aplicaciones.",
  "Wireless Network Hacking": "Identifica vulnerabilidades en redes inalámbricas para mejorar su seguridad.",
  "Mobile Platform Hacking": "Mejora la seguridad de aplicaciones y plataformas móviles.",
  "IoT Hacking": "Protege dispositivos y redes IoT contra posibles amenazas.",
  "Cloud Computing Hacking": "Refuerza la seguridad de soluciones basadas en la nube para prevenir filtraciones de datos.",
  "Generative AI": "Automatiza procesos creativos como la generación de contenido, mejorando la productividad.",
  "Python": "Soporta análisis de datos, aprendizaje automático y automatización, crucial para proyectos de inteligencia artificial.",
  "R": "Proporciona herramientas estadísticas para el análisis de datos y visualización en proyectos de investigación.",
  "TensorFlow": "Permite construir y entrenar modelos complejos de aprendizaje automático.",
  "PyTorch": "Soporta investigaciones avanzadas de inteligencia artificial con gráficos computacionales dinámicos.",
  "Pandas": "Simplifica la manipulación y preprocesamiento de datos para flujos de aprendizaje automático.",
  "NumPy": "Facilita cálculos numéricos para el procesamiento de datos y modelos de IA.",
  "Scikit-learn": "Ofrece herramientas para construir y evaluar modelos de aprendizaje automático.",
  "Jupyter": "Permite la experimentación y el intercambio de código, visualizaciones e ideas.",
  "Matplotlib": "Ayuda a crear visualizaciones claras para análisis y presentaciones de datos.",
  "OpenAI API": "Proporciona acceso a modelos de lenguaje de última generación para tareas de procesamiento del lenguaje natural.",
  "index": {
    "welcome_back": "¡Bienvenido de nuevo! Tu token de sesión ha sido verificado.",
    "first_time": "Hola, parece que es la primera vez que entras."
  },
  "projects_page": {
    "session_notice": "Tus conversaciones y cookie de sesión se almacenan con fines prácticos y pueden ser revisadas. Piensa bien la información que compartes. ¿Buscas proteger la privacidad de tus datos en IA? Contáctame.",
    "dismiss": "Cerrar",
    "title": "Proyectos"
  },
  "sections": {
    "chatbot_cyber": "Chatbot Ciber seguridad",
    "chatbot_cyber_desc": "Interactúa con un chatbot especializado en ciberseguridad.",
    "chatbot_llms": "Chatbot sobre LLMs",
    "chatbot_llms_desc": "Obtén información de un chatbot enfocado en LLMs.",
    "db_query_agent": "Agente de consulta a una DB",
    "db_query_agent_desc": "Consulta tu base de datos usando lenguaje natural.",
    "photos_journey": "Fotos de mi trayectoria",
    "photos_journey_desc": "Mira una colección de fotos clave de mi carrera profesional.",
    "integrate_whisper": "Integrar Whisper",
    "integrate_whisper_desc": "Experimenta la transcripción de audio de forma integrada con Whisper.",
    "youtube_videos": "Videos de Youtube",
    "youtube_videos_desc": "Visualiza videos seleccionados que destacan mis proyectos.",
    "conversation_history": "Histórico de conversaciones",
    "conversation_history_desc": "Accede al registro de tus conversaciones con el bot.",
    "generative_ai_business": "Integra la IA generativa a tu negocio",
    "generative_ai_business_desc": "Descubre cómo la IA generativa puede transformar tu negocio.",
    "learn_english": "Aprende inglés",
    "learn_english_desc": "Visita CIEX y aprende inglés con expertos."
  }
}

